Revit 2016 API
UIView.Close Method
Closes the view.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
public void Close()
Visual Basic
Public Sub Close
Visual C++
public:
void Close()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException | Cannot close a project's only open view.
See Also
UIView Class
Autodesk.Revit.UI Namespace